/*===================================
  ■■■ 자바 기본 프로그램 ■■■
- 자바 소스코드 입력 및 컴파일 실습
- 실행 및 관찰
================================ ====*/



// - 클래스 이름은 『Test002』

public class Test002
{
	public static void main(String[] args)
	{
		System.out.println("안녕하세요");
		System.out.println("김민지입니다.");
		System.out.println("오늘은 8월 23일입니다.");

		System.out.print("반갑습니다.");
		System.out.print("화이팅합니다~");

		// 『println()』과 『print()』 메소드는
		// 같은 상자에서 꺼낸 유사한 도구이지만
		// 이 도구는 서로 다른 도구이며,
		// 두 메소드의 차이는 
		// 라인 스킵(줄바꿈) 유무
	}
}

// 실행 결과

/*
안녕하세요
김민지입니다.
오늘은 8월 23일입니다.
반갑습니다.화이팅합니다~계속하려면 아무 키나 누르십시오 . . .
*/