/*=======================================================
  ■■■ 실행 흐름의 컨트롤 (제어문) ■■■
  - 반복문(for문) 실습 및 관찰 
  - 다중 for문(반복문의 중첩)을 활용한 구구단 출력 실습
  =======================================================*/

 // 실행 예)

 /*
 
 2 * 1 = 2   3 * 1 = 3   4 * 1 = 4   5 * 1 = 5  
 2 * 2 = 2   3 * 2 = 6   4 * 2 = 8   5 * 2 = 8
   :		   :		   :		   :
 2 * 9 = 18	 3 * 9 = 27	 4 * 9 = 36  5 * 9 = 45
	
 6 * 1 = 6	 7 * 1 = 7	 8 * 1 = 8	 9 * 1 = 9
   :			:		   :		   :
 6 * 9 = 52	 7 * 9 = 63	 8 * 9 = 72  9 * 9 = 81

① 2중첩 * 2
② 3중첩 * 1
 */


public class Test059
{
	public static void main(String[] args)
	{
	
	// 방법 ① 2중첩 * 2 --------------------------------------------------------------------------------
	/*	
	int i,j,m,n;			// for문 변수

	for (i=1; i<=9; i++ )
	{	
		for (j=2; j<=5; j++ )
		{
			System.out.printf("%2d * %d = %2d  " , j, i,(j*i));
		}
		
		System.out.println();
	
	}

	System.out.println();

	for (m=1; m<=9; m++)
	{
		for (n=6; n<=9; n++)
		{
			System.out.printf("%2d * %d = %2d  ", n, m ,(n*m));
		}
		System.out.println();
	}
	*/
	//--------------------------------------------------------------------------------------------------

	// 방법 ② 3중첩 * 1 --------------------------------------------------------------------------------
	/*
		

	int i,j,m,n=0;			// for문 변수

	for (i=1; i<=2; i++)
	{
		for (j=1; j<=9; j++)
		{
			for (m=(2+n); m<=(5+n); m++)
			{
				System.out.printf("%d * %d = %2d  ", m, j,(m*j));
				
			}

			System.out.println();

		}
		
		System.out.println();
		n+=4;

	}

	*/ 
	// ☆★ 다른 친구들이 풀어본 방법(다시 스스로 해보기 다른 값에 +4 나 *4를 해보기!!!) ☆★
	/*
	int i,j,m,n=0;
	for (i=0;i<=4 ;i+=4)
	{
		for (j=1; j<=9; j++)
		{
			for (m=2; m<=5; m++)
			{
				System.out.printf("%d * %d = %3d  ", m+i, j, m*j );
			}
			System.out.println();
		}

	}
	*/

		
	//--------------------------------------------------------------------------------------------------

	// 수업하며 같이 풀어본 내용 -----------------------------------------------------------------------

	// ① Test058과 비교하여 
	//	  출력 방향(출력의 순서)가 다르기 때문에 
	//    반복문의 제어 흐름도 달라져야 한다.
	//	  (한 방향으로 처리되는 콘솔 기반의 출력 환경이기 때문에)

	// ② (1)에 따라 
	//    『단』과『곱해지는 수』의 위치가 
	//	   달라진 상태에서의 반복문 구성


	//      2중첩 * 2
	/*
	for (int i=1; i<=9; i++)					//웅~	  → 곱해지는 수 1 2 3 4 5 6 7 8 9
	{
		for (int j=2; j<=5; j++)				//쑝쑝쑝  → 단
		{
			System.out.printf("%4d * %d = %2d", j, i ,(j*i));
		}
		System.out.println();					//개행
	}
	
	System.out.println();						//개행

	for (int i=1; i<=9; i++)					//웅~	  → 곱해지는 수 1 2 3 4 5 6 7 8 9
	{
		for (int j=6; j<=9; j++)				//쑝쑝쑝  → 단
		{
			System.out.printf("%4d * %d = %2d", j, i ,(j*i));
		}
		System.out.println();
	}

	*/

	//③ (2)에서 처리한 결과를
	//	 두 문장으로 반복하는 반복문 구성
	//	 Check~!! 두번 반복하는 반복문에 (2)의 결과를 삽입 
/*
	for (int h=0; h<=1; h++)			//문단 구성 check~~~!!	→ 0 1 총 2번 반복~~
	{
		//System.out.println("테스트 " + h);
		for (int i=1; i<=9; i++)					//웅~		→ 곱해지는 수 1 2 3 4 5 6 7 8 9
		{
			for (int j=2; j<=5; j++)				//쑝쑝쑝	→ 단
			{
				System.out.printf("%4d * %d = %2d", j, i ,(j*i));
			}
			System.out.println();					//개행
		}
		
	}
*/
	// ④ 같은 구문을 
	//	  두 문단으로 나누어 처리하는 과정에서 
	//	  문단에 따라 다르게 주어지는 환경(h의 값)을 활용하는 방법으로 
	//	  최종 반복문 3중첩 구성

	
	for (int h=0; h<=1; h++)			//문단 구성 check~~~!!	→ 0 1 총 2번 반복~~
	{
		for (int i=1; i<=9; i++)					//웅~		→ 곱해지는 수 1 2 3 4 5 6 7 8 9
		{
			for (int j=2; j<=5; j++)				//쑝쑝쑝	→ 단
			{
				System.out.printf("%4d * %d = %2d", j+(h*4), i ,((j+(h*4))*i));
			}
			System.out.println();					//개행
		}
		System.out.println();					//개행
	}
	



	//--------------------------------------------------------------------------------------------------

		
	} // end main()

}// close class Test059

//실행결과
/*
 2 * 1 =  2   3 * 1 =  3   4 * 1 =  4   5 * 1 =  5
 2 * 2 =  4   3 * 2 =  6   4 * 2 =  8   5 * 2 = 10
 2 * 3 =  6   3 * 3 =  9   4 * 3 = 12   5 * 3 = 15
 2 * 4 =  8   3 * 4 = 12   4 * 4 = 16   5 * 4 = 20
 2 * 5 = 10   3 * 5 = 15   4 * 5 = 20   5 * 5 = 25
 2 * 6 = 12   3 * 6 = 18   4 * 6 = 24   5 * 6 = 30
 2 * 7 = 14   3 * 7 = 21   4 * 7 = 28   5 * 7 = 35
 2 * 8 = 16   3 * 8 = 24   4 * 8 = 32   5 * 8 = 40
 2 * 9 = 18   3 * 9 = 27   4 * 9 = 36   5 * 9 = 45

 6 * 1 =  6   7 * 1 =  7   8 * 1 =  8   9 * 1 =  9
 6 * 2 = 12   7 * 2 = 14   8 * 2 = 16   9 * 2 = 18
 6 * 3 = 18   7 * 3 = 21   8 * 3 = 24   9 * 3 = 27
 6 * 4 = 24   7 * 4 = 28   8 * 4 = 32   9 * 4 = 36
 6 * 5 = 30   7 * 5 = 35   8 * 5 = 40   9 * 5 = 45
 6 * 6 = 36   7 * 6 = 42   8 * 6 = 48   9 * 6 = 54
 6 * 7 = 42   7 * 7 = 49   8 * 7 = 56   9 * 7 = 63
 6 * 8 = 48   7 * 8 = 56   8 * 8 = 64   9 * 8 = 72
 6 * 9 = 54   7 * 9 = 63   8 * 9 = 72   9 * 9 = 81
계속하려면 아무 키나 누르십시오 . . .

*/